{"pageProps":{"experienceData":[{"id":"courseproducer","contentHtml":"<ul>\n<li>Explained key algorithm concepts and walked through homework problems with students during weekly office hours to help build intuition in algorithms and advance problem solving skills</li>\n<li>Managed homework grading platform for class of 200+ with instant response to reported issues to ensure a smooth experience for students and graders</li>\n<li>Introduced a spreadsheet to keep track of and provide a clear and instant representation of 200+ students’ homework submission late day usage across 10 assignments</li>\n</ul>\n","company":"USC Viterbi","title":"Course Producer","dateStart":"August 2021","ended":true,"dateEnd":"December 2022","logo":"usc.svg","tech":[]},{"id":"encore","contentHtml":"<ul>\n<li>Developed responsive single-page application with ReactJS and Typescript to showcase key company resources</li>\n<li>Implemented and refined 10+ reusable front-end components with MaterialUI used throughout website</li>\n<li>Engineered backend of project with Axios and React hooks to connect components to company’s public API</li>\n<li>Established payment gateway with Stripe API and Express.js to process in-app purchases</li>\n<li>Engaged in weekly code reviews and got feedback from senior developers</li>\n</ul>\n","company":"Encore","title":"Software Intern","dateStart":"January 2022","ended":true,"dateEnd":"May 2022","logo":"encore.svg","tech":["js","react","ts"]},{"id":"quill","contentHtml":"<ul>\n<li>Founding engineer building embedded analytics platform serving 10+ clients. Architected complete refactor of core ReportBuilder component, implementing AST-driven architecture that reduced initial query load times by 90% across 8 database types including PostgreSQL, BigQuery, and Snowflake.</li>\n<li>Redesigned SQL generation system using Abstract Syntax Tree parsing to eliminate query bugs and enable consistent application of complex multi-tenant filtering across all supported database types.</li>\n<li>Built sophisticated multi-tenancy architecture supporting hierarchical data relationships, enabling enterprise customers to serve their own multi-tenant applications with cross-table filtering capabilities.</li>\n<li>Expanded SDK coverage from 2 to 6 programming languages (Node.js, Python, PHP, Go, Ruby, .NET) with comprehensive database integration testing, directly contributing to acquisition of major enterprise clients.</li>\n</ul>\n","company":"Quill","title":"Founding Engineer","dateStart":"July 2024","ended":true,"dateEnd":"August 2025","logo":"quill_logo.png","tech":["next","react","ts"]}]},"__N_SSG":true}